Maxima 5.44.0 http://maxima.sourceforge.net
using Lisp SBCL 2.0.0
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) batch("Maxiplot-eksempel-med-GNUPlot.mac")

read and interpret C:/Users/ole/OneDrive/Dokumenter/GitHub/MaxiplotNG/Maxiplot-eksempel-med-GNUPlot.mac
(%i2) nolabels:true
(%i3) display2d:false
(%i4) load("mactex.lisp")
(%i5) set_plot_option([run_viewer,false])
(%i6) set_tex_environment_default("","")
(%i7) lbrace:"{"
(%i8) rbrace:"}"
(%i9) file_output_append:false
(%i10) with_stdout("Maxiplot-eksempel-med-GNUPlot.mxp")
(%i11) file_output_append:true
(%i12) load("mactex-utilities.lisp")
(%i13) with_stdout("Maxiplot-eksempel-med-GNUPlot.mxp",
                   print("\\gdef\\mxpi",lbrace),tex(x+y+z+t = 0),
                   print(rbrace))
(%i14) ordergreat(x,y,z)
(&=)
(%i15) with_stdout("Maxiplot-eksempel-med-GNUPlot.mxp",
                   print("\\gdef\\mxpii",lbrace),eq1:a-2*b = x+y,
                   eq2:b = 2*x-3*y+2*z,tex(eq1),print("\\\\"),tex(eq2),
                   print(rbrace))
(%i16) unorder()
(=)
(%o18) "C:/Users/ole/OneDrive/Dokumenter/GitHub/MaxiplotNG/Maxiplot-eksempel-med-GNUPlot.mac"
